[
{"History": [" is an American energy company based in ", ", Texas. As one of the world's largest ", " companies, it provides products and services for ", " drilling, ", ", ", ", production, reservoir consulting, and tubular running services. It operates in over 120 countries, with research and manufacturing facilities in Australia, Singapore, Malaysia, India, Dubai, Saudi Arabia, Italy, Germany, Norway, Oklahoma, Louisiana and Missouri. From 2017 to 2020, the company was majority owned by ", " (GE); however, GE no longer owns an economic stake in the company.", " The company is ", ".\n", "The company divides its organization into the following segments:", "\n", "Baker Hughes traces its roots to the 1987 merger of ", " and Baker Oil Tool Company and the company has subsequently grown via acquisitions.\n", "The ", " was founded in 1908 by business partners ", " and ", ", father of ", ", Jr. That year, Hughes, Sr. and Sharp developed the first ", ", designed to enable ", " in harder, deeper formations than was possible with earlier fishtail bits. They conducted two secret tests on a drilling rig in ", ". Each time, Hughes asked the drilling crew to leave the rig floor, pulled the bit from a locked wooden box, and then his associates ran the bit into the hole. The drill pipe twisted off on the first test, but the second was extremely successful. Following these successful drill bit tests, the partners founded the Sharp-Hughes Tool Company in 1909. The first shop to manufacture the bit occupied a 20-foot by 40-foot rented space. On August 10, 1909, the ", " granted a patent to Hughes.", "\n", "After Walter Sharp died in 1912, Hughes purchased Sharp's half of the business. The company was renamed Hughes Tool Company in 1915, and Hughes, Jr. inherited it after his father's death in 1924. In 1933, the company introduced the Tricone drill bit.", " Through the 1950s and 1960s, Hughes Tool Company remained a private enterprise, owned by Hughes. While Hughes was engaged in his Hollywood and aviation enterprises, managers in Houston, such as Fred W. Ayers and Maynard Ellsworth Montrose, kept the tool company growing through technical innovation and international expansion. In 1958, the Engineering and Research Laboratory was enlarged to accommodate six laboratory sections that housed specialized instruments, such as a direct reading spectrometer and x-ray diffractometer. In 1959, Hughes introduced self-lubricating, sealed bearing rock bits. After collecting data from thousands of bit runs, Hughes introduced the first comprehensive guides to efficient drilling practices in 1960; in 1964, X-Line rock bits were introduced, combining new cutting structure designs and hydraulic jets.\n", "Hughes Tool Company acquired Brown Oil Tools in 1978.", " Brown Oil Tools was founded by Cicero C. Brown in 1929 in Houston and patented the first liner hanger in 1937. Liner hangers enable drillers to lengthen their casing strings without having the liner pipe extend all the way to the surface. This saves capital cost and reduces weight borne by offshore platforms.\n", "Oil Base Inc. (OBI), founded by George Miller in 1942, was acquired by Hughes Tool Company in 1979, and renamed Hughes Drilling Fluids in 1982. In 1949, OBI introduced Black Magic SFT, a drilling fluid additive to free stuck pipe that is still sold today.", "\n", " (1872–1957) was a farm boy who never advanced in school beyond the third grade. He followed his brother Aaron Alphonso Baker into the oil business. In 1895, he got a job in a California oilfield driving a horse team to haul oil for drillers. One year later, he became a drilling contractor. In July 1907, he was granted a U.S. patent for a ", " that enabled drillers to efficiently run casing and cement it in oil wells.", " The casing shoe revolutionized cable tool drilling by ensuring the uninterrupted flow of oil through the bottom of the casing in the well. In 1913, he founded Baker Casing Shoe Company. In the 1920s, it expanded into national and international markets. In 1928, Baker Casing Shoe Company changed its name to Baker Oil Tools, Inc. to reflect its product line of completion, cementing, and fishing equipment. Baker Oil Tools expanded to Houston in the 1920s.\n", "In 1942, driven in part by the shortage of steel during ", ", the company introduced the Model D Packer, which enabled multiple completions in the same well.", " In 1943, the company earned the Army-Navy E Flag for its wartime manufacturing contributions.", "\n", "In early 1956, during one of the most successful periods in the company's history, Baker retired as President of Baker Oil Tools and was succeeded by his long-time associate Ted Sutter. Baker died only a few weeks later after a brief illness at the age of 85. Although he only had three years of formal education, Baker received more than 150 patents in his lifetime.", " In 1962, it acquired Pressure Services.", " In 1963, it acquired Kobe, one of the largest manufacturers of hydraulic systems for oil well pumping.", "\n", "In 1964, Sutter was succeeded by E.H. \"Hubie\" Clark, who became the first Baker Hughes chairman of the board in 1987. During its 80-year history prior to its merger with Baker Hughes, Baker Oil Tools had only three chief executive officers.\n", "In 1970, Baker Oil Tools acquired Lynes, Inc., which produced liner hangers and other completion equipment. In 1978, Baker Oil Tools introduced the Bakerline casing liner hanger.  In 1985, the FlexLock Liner Hanger was introduced, extending the performance range and functionality of liner hanger systems. In 1987, the Brown liner hanger technology was merged into Baker Oil Tools. In 1992, Baker Oil Tools introduced the ZXP Liner Top Packer, with expandable metal seals, which set the stage for development of expandable screens, casing systems and liner hangers. In 1994, Baker Oil Tools introduced multilateral completion systems, which enabled operators to install completion tools and perform selective intervention work in multiple horizontal sections from a common main ", ".\n", "In 1971, the company acquired ", ", a provider of ", ", for approximately $20 million in stock.", " In 1931, Max B. Miller devised a drilling mud using a white clay as a weighting material. To market the new mud, he formed The Milwhite Company in Texas. In the mid-1930s, the company mined barites in conjunction with the Magnet Cove Barium Corporation (later called Magcobar). After a hiatus during World War II, the company resumed grinding operations using barite from a mine in Missouri and conducted mud sales through independent distributors. After 1956, Milwhite Mud Sales Company built its own sales network. In 1963, the company acquired Aquaness, and in 1964 the combination became ", ".\n", "In 1972, the company acquired Exploration Logging Company (EXLOG), a leader in ", ".", " EXLOG was founded in 1952 in ", " by Vern C. Jones, and had 800 employees.", "\n", "In November 1975, the company acquired Reed Tool Cornpany of Houston in a $120 million stock transaction.", "\n", "In 1976, it became Baker International Corporation with almost all of its operations headquartered in Houston.", "\n", "In 1985, Baker International acquired the drilling fluids division of ", " and merged it with Milchem's mud division to form Milpark.", "\n", "As a result of the ", ", in 1987, Baker International merged with Hughes Tool Company in a $728 million stock transaction to form Baker Hughes Incorporated.", " The merger required Baker to enter into a ", " to divest Reed Tool Company, Reed's facility in Singapore, and its Baker Lift division. Hughes attempted to terminate the agreement after Baker entered into the consent decree; however, Baker sued Hughes for $1 billion and Hughes shareholders voted overwhelmingly to complete the transaction.", "\n", "In April 2007, the company pleaded guilty in U.S. federal court to violations of the ", " (FCPA) and agreed to pay $44.1 million in fines and penalties for making $4.1 million in \"", "\" payments between 2001 and 2003 that allegedly resulted in an oil-services contract in the ", " in ", ".", "\n", "In 2001, the company introduced the largest ", " vessel for deepwater work in the ", ". It was named after founder ", "\n", "On June 11, 2012, during the annual period of negotiations between trade unions, including SAFE, the Norwegian union for energy workers, and their employer counterparts in Norway, 114 Baker Hughes employees were called to a ", ", which would have affected over a dozen installations.", " On June 18, 2012, the strike was called off after the parties agreed to a new collective agreement.", "\n", "In January 2019, Baker Hughes pledged to reduce ", " emissions by 50% by 2030, and 100% by 2050 from a 2012 baseline.", "\n", "In June 2021, Baker Hughes signed a ", " with Borg CO", " to develop carbon capture, liquefaction, and transportation technologies on a waste-to-energy plant in ", ".", "\n", "In 1989, the company acquired ", " for $47.5 million, Vetco Services for $37 million, and EDECO Petroleum Services for $12.1 million. In 1990, the company acquired Eastman Christensen, a leader in directional drilling systems and diamond bit technology, for $600 million. It also acquired the instrumentation units of Tracor Holdings for $93.7 million in cash and ", " for $136 million in cash.", " In 1990, the company also sold Totco division of its Exlog subsidiary to ", " for $41 million in cash and stock.", "\n", "In 1929, H. John Eastman introduced \"controlled ", "\" in Huntington Beach, California, using whipstocks and magnetic survey instruments to deflect the drill pipe from shore-based rigs to reach oil deposits offshore. In 1934, Eastman Whipstock Inc. was founded by Eastman and Roman W. Hines, the same year the company drilled the world's first ", " to control a blowout in ", ", that had been on fire for more than a year.\n", "In 1957, ", "'s Christensen Diamond Products opened a manufacturing plant in ", ", Germany. The facility built diamond core heads and drilling bits and soon began producing stabilizers, drilling jars and other equipment. In 1977, the Celle engineering and manufacturing team introduced the Navi-Drill line of downhole drilling motors, which has led the drilling industry in performance and reliability for three decades. Other innovations developed in Celle include the industry's first steerable motor system, and the AutoTrak Rotary Closed Loop System, a pioneering ", " tool. In 1978, Christensen Diamond Products was acquired by Norton Co. and changed its name to Norton Christensen. In 1986, Eastman Whipstock merged with Norton Christensen to form Eastman Christensen.\n", "In 1990, Baker Hughes acquired Eastman Christensen from ", " for $550 million. To receive approval from the ", ", the company sold its Hughes Tool diamond bit business.", " Baker Hughes combined Eastman Christensen and the remainder of Hughes Tools to form Hughes Christensen.\n", "In 1993, Hughes Christensen introduced the AR-Series PDC bits, anti-whirl bits with increased penetration rates up to 100% in some applications and extended bit life as much as four-fold, compared to previous bit designs.", " By 1995, Hughes Christensen's Gold Series PDC line increased drilling efficiency by reducing the frictional forces that can accumulate in front of the cutting edge, reducing the energy required to remove the rock.", " In 1996, patented ChipMaster PDCs, known for their efficiency and durability, were built on the success of the Eggbeater product line. Hughes Christensen next introduced the Genesis HCM bits for steerable motors with patented EZSteer depth-of-cut control technology. This same technology was adapted to Genesis HCR bits for rotary steerable systems, such as the Baker Hughes AutoTrak rotary closed loop system. Genesis ZX PDCs followed with new Zenith cutters.\n", "In April 1992, Baker Hughes acquired Teleco Oilfield Services, a provider of directional measurement-while-drilling technology, from ", " for $200 million cash, preferred stock and royalty from future sales of Teleco's \"triple combo\" sensors.", " Teleco Oilfield Services was founded in 1972 and introduced the world's first MWD tool in 1978. Teleco had approximately 1,300 employees, including 430 in ", ".", " In 1993, Baker Hughes INTEQ was formed by combining five of the company's oilfield divisions.", "\n", " was formed in 1930 from the merger of William Barnickel's Tret-O-Lite with Petroleum Rectifying Company of California (PETRECO). In 1997, Baker Hughes acquired Petrolite for $693 million in stock. At that time, Wm. S. Barnickel & Co. owned 47% of Petrolite.", "\n", "In 2003, the division acquired Cornerstone Pipeline Inspection Group.", "\n", "In 1997, the company acquired Drilex, a provider of drilling products and services, for $109 million in stock.", "\n", "In 1998, the company acquired Western Rock Bit Company, a Canadian bit distributor, for $30.8 million.", "\n", ", which specialized in finding oil by mapping geological formations with sound waves and using wires to manipulate tools and gauges in oil and natural-gas wells, was divested from ", " in 1994.", " In 1995, ", " acquired 50% of PetroAlliance Services Company, Ltd., which offered seismic, well-logging, and integrated project services in the ", ". In May 1997, Western Atlas acquired Sungroup Energy Services, a Canadian ", ", production testing, and completion services provider. During the fourth quarter of 1997, Western Atlas acquired Geosignal, a seismic data processing company; Seismic Resources, a provider of nonexclusive seismic surveys; and ParaMagnetic Logging, a well-logging research company. In the fourth quarter of 1997, the company acquired Heartland Kingfisher, a Canadian well-logging company.", "\n", "On August 10, 1998, Baker Hughes acquired ", " for $5.5 billion in stock plus the assumption of $700 million in debt.", " The acquisition was made in part to prevent an acquisition of Western Atlas by ", ".", " The acquisition added strong seismic-data operations as well as downhole wireline and testing services.", "\n", "In 1999, the only new seismic technology that was being introduced was the 4-dimensional seismic survey monitoring.", "\n", "In 2000, during a downturn in the ", ", the company merged its Western Geophysical division with ", "'s ", " to form ", ".", "\n", "In 2006, Baker Hughes sold its 30% share of WesternGeco to Schlumberger for $2.4 billion in cash.", "\n", "In 2001, Baker Hughes acquired OCRE (Scotland) Ltd. from Maritime Well Service, a division of ", ".", "\n", "In February 2006, Baker Hughes acquired Nova Technology Corporation, a supplier of permanent monitoring, chemical injection systems, and multiline services for deepwater and subsea oil and gas well applications, for $70 million in cash and assumed debt.", "\n", "In October 2010, Baker Hughes acquired JOA Oil & Gas BV. JOA developed JewelSuite, a reservoir modelling software.", "\n", "In 1990, the company sold a 71% stake in ", " via an ", ". On April 28, 2010, Baker Hughes re-acquired ", ".", " In 2017, after the division suffered ", " losses, the company sold a majority interest in BJ Services to ", " to obtain approval for the merger with ", ".", "\n", "In November 2014, the company agreed to a merger with ", " valued at $34.6 billion.", " If consummated, it would have been the largest merger in the history of the ", ". The merger was approved by both companies' stockholders; however, on April 6, 2016, the ", " sued to block the transaction due to concerns that the merger would affect competition and prices in the oilfield service industry.", " On May 1, 2016, the companies terminated the merger agreement due to the regulatory opposition.", "\n", "In July 2017, the company merged with ", ".", " As part of the transaction, the company sold a 53.3% percent stake in the hydraulic fracturing and cementing business to CSL Capital Management and ", "’ West Street Energy Partners for $325 million.", " ", " announced plans to divest its stake by 2023; by year-end 2021, its remaining ownership was approximately 11.4%.", "\n", "In 2019, the company sold its Reciprocating Compression division to ", ", a ", ".", "\n", "In September 2020, Sterling Auxiliaries & Artek Surfin Chemicals acquired Baker Hughes' Sand Springs chemical manufacturing facility.", "\n", "In November 2020, Baker Hughes acquired Compact Carbon Capture, a company developing solvent-based carbon capture patents.", "\n", "In December 2020, Baker Hughes set up a joint venture with ", " to create a non-metallic materials company called Novel Non-Metallic Solutions Manufacturing. Novel's facility is being developed at ", ".", "\n", "In 2021, Baker Hughes acquired ARMS Reliability, a company providing advisory services and software to several industries.", "\n", "In March 2021, Baker Hughes acquired a license for the use of Mixed-Salt Process technology for ", " ", " from ", ".", "\n", "In March 2021, Baker Hughes announced the creation of a joint venture for drilling services with Akastor ASA's subsidiary, MHWirth AS.", "\n", "in March 2022, Baker Hughes acquired Altus Intervention, an oilwell specialist company headquartered in Norway.", "\n", "In August 2022, after the ", ", the company agreed to sell its operations in Russia to local management.", "\n", "In November 2022, the company acquired Quest Integrity from Team, Inc. for $279 million.", "\n"]}
]