[
{"History": [" (", "; stylized in ", ") is an Indian ", " that provides ", ", ", " and ", " services. It is one of the six leading Indian ", " companies. Wipro's capabilities range across ", ", ", ", ", ", ", ", ", ", ", ", and other technologies, servicing customers in 167 countries.", "\n", "The company was incorporated on 29 December 1945 in ", " by MH Hasham Premji as ", ", a manufacturer of ", ".", " In 1966, after Hasham Premji's death, his son ", " dropped out of ", " and took over as ", " at age 21.", "\n", "The company changed its name to ", " in 1977, followed by Wipro Limited, a ", " of the original name, in 1982.", "\n", "In the 1980s, the company established subsidiaries Wipro Infotech and Wipro Systems. In 1981, Wipro developed the first Indian ", " based on the ", " chip in an ", " lab.", " The software division began in 1984 with the development of a ", " and ", " suite but shifted to ", " in 1990.", "\n", "By the mid-1990s, Wipro had become one of India's leading manufacturers of ", ", ", ", and medical diagnostic equipment.", " In 1998, the company reported being the second-largest software exporter from India,", " and gradually increased its focus on the higher-", " software services business which accounted for the vast majority of its profits.", "\n", "During the ", " of the early 2000s, Wipro became the most-valued company in India, with a peak ", " three times that of the next largest listed company, ", ". Consequently, Azim Premji's net worth increased significantly, making him the ", " for five consecutive years.", "\n", "In 2004, Wipro became the second listed Indian IT company to report annual revenues exceeding US$1 billion.", " By 2006, approximately 30% of its total revenue came from ", " services.", "\n", "In 2007, Wipro introduced a line of ", " known as ", ".", " In 2011, Wipro, in collaboration with the ", " (ISRO), developed India's then-fastest supercomputer, ", ", which was deployed at the ", ".", "\n", "In 2012, Wipro ", " its non-IT businesses into a new private company named ", ".", " Prior to this demerger, these businesses—primarily in consumer care, lighting, furniture, hydraulics, water treatment, and medical diagnostics—accounted for about 14% of Wipro's total revenues.", "\n", "Wipro acquired cloud services company ", " for $500 million in 2016, technology consultancy ", " for $1.45 billion in 2021, and SAP consulting firm Rizing Intermediate Holdings for $540 million in 2022.\n", "Wipro operates in over 60 countries and serves clients in industries such as financial services, healthcare, manufacturing, retail, and telecommunications. Major services provided by Wipro are:\n", "Wipro's equity shares have been listed on ", " since 1946 and the ", " where it is a constituent of the ", ". The ", " of the company are listed on the ", " (NYSE) since October 2000.", "\n", "As of March 2024, the promoter group headed by ", " held a 72.88% stake in the company, while the remaining shares were with ", " and an ", ".", "\n", "As of 31 March 2024, it had 234,054 employees, out of which 36.6% were women. The attrition rate was around 14% during FY 2023-24, against 19% in previous financial year.", "\n", "List of CEOs since 1981:", "\n", "In February 2023, Wipro faced criticism for reducing the annual salary package of new hires by 50%. This decision affected around 4,000 new hires, leading to backlash from employee unions like NITES, which called the move unfair and lacking transparency. Wipro stated that the revised offer was due to changing business needs and provided an immediate opportunity for candidates to start their careers.", "\n"]}
]